backend/app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
    def index
        conversations = Conversation.all

INSERT INTO "conversations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "a new conversation"], ["created_at", "2022-02-22 18:06:14.393085"], ["updated_at", "2022-02-22 18:06:14.393085"]]
---
    def create
        conversation = Conversation.new(conversation_params)
        if conversation.save