backend/app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 5]]
---
    def index
      messages = @current_user.messages.all

INSERT INTO "messages" ("text", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Catch me if you can"], ["conversation_id", 2], ["user_id", 2], ["created_at", "2022-03-01 20:09:13.211168"], ["updated_at", "2022-03-01 20:09:13.211168"]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("text", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Halo"], ["conversation_id", 1], ["user_id", 5], ["created_at", "2022-03-04 01:24:01.421140"], ["updated_at", "2022-03-04 01:24:01.421140"]]
---
    def create
      message = @current_user.messages.create(message_params)
      conversation = Conversation.find(message_params[:conversation_id])
        if message.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def find_user
      user = User.find_by_id(params[:user_id])