backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ant"], ["LIMIT", 1]]
---
    def create
        @user = User.find_by(username: session_params[:username])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def is_logged_in?
      @current_user = User.find(session[:user_id]) if session[:user_id]