backend/app/channels/messages_channel.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def subscribed
    user = User.find(params[:user])
    conversation = Conversation.find(params[:conversation])